---
kind: property
id: P:Autodesk.Revit.UI.UIControlledApplication.ActiveAddInId
source: html/21e99ede-839f-8230-e399-2b1ae831f643.htm
---
# Autodesk.Revit.UI.UIControlledApplication.ActiveAddInId Property

Get current active external application or external command id.

## Syntax (C#)
```csharp
public AddInId ActiveAddInId { get; }
```